Repository: zefr0x/cys403_project
Catalog: po/*.po
Languages: ar

source: CYS-403 Project
ar: مشروع CYS-403

source: Simple text and image encryption.
ar: أداة بسيطة لتعمية النصوص والصور.

source: Encryption Utility
ar: أداة تعمية

source: rsa;cipher;
ar: آر‌إس‌أي;تعمية;

source: RSA
ar: آر‌إس‌أي

source: Image
ar: صورة

source: <b>ERROR: %s</b>
ar: <b>خطأ: %s</b>

source: translator-credits
ar: zefr0x

source: External Libraries
ar: المكتبات الخارجية

source: Application Icon
ar: أيقونة التطبيق

source: Key Generation Options
ar: خيارات توليد المفتاح

source: Cancel
ar: ألغِ

source: Generate
ar: ولِّد

source: Symmetric Key Options
ar: خيارات المفتاح المتماثل

source: Key Size
ar: حجم المفتاح

source: Number of Bytes
ar: عدد البايتات

source: Generate New Key…
ar: ولِّد مفتاح جديد…

source: <b>Private Key</b>
ar: <b>المفتاح الخاص</b>

source: Open Image File…
ar: افتح ملف صورة…

source: <b>Input Image</b>
ar: <b>الصورة المُدخلة</b>

source: Encrypt Image
ar: عَمِّ الصورة

source: Decrypt Image
ar: فُكْ تعمية الصورة

source: Save Image File…
ar: احفظ ملف الصورة…

source: <b>Output Image</b>
ar: <b>الصورة المُدخلة</b>

source: Private key input contain invalid base64 text.
ar: مُدخَل المفتاح الخاص ذو ترميز الأساس64 يحتوي على نص غير صالح.

source: Select Input Image
ar: اختر الصورة المُدخلة

source: _Cancel
ar: أل_غِ

source: _Open
ar: ا_فتح

source: _Save
ar: ا_حفظ

source: Output has not been determined, there is noting to be saved.
ar: لم تُحَدَّد المخرجات، لا يوجد ما يمكن حفظه.

source: Failed to open and display image, key size doesn't match.
ar: تعذَّرَ فتح وعرض الصورة، حجم المفتاح غير مطابق.

source: Corrupted Input
ar: مُدْخَل تالِف

source: Output buffer is empty, there is noting to be save.
ar: صِوان الإخراج فارغ، لا يوجد ما يمكن حفظه.

source: Input buffer is empty, there is noting to be encrypted.
ar: صِوان الإدخال فارغ، لا يوجد ما يمكن تعميته.

source: Private key is empty, can't encrypt.
ar: المفتاح الخاص فارغ، تتعذَّرُ التعمية.

source: Input buffer is empty, there is noting to be decrypted.
ar: صِوان الإدخال فارغ، لا يوجد ما يمكن فَك تعميته.

source: Private key is empty, can't decrypt.
ar: المفتاح الخاص فارغ، تتعذَّرُ فَك التعمية.

source: Failed to decrypt and display image, key size doesn't match.
ar: تتعذَّر فك تعمية الصورة وعرضها، حجم المفتاح غير مطابق.

source: Corrupted Output
ar: مُخرَج تالف

source: RSA Key Options
ar: خيارات مفتاح آر‌إس‌أي

source: Modulo Size
ar: حجم عامل القسمة مع الباقي

source: Exponents of 2
ar: أُسُس العدد 2

source: Public Exponent
ar: الأُس العام

source: Must be prime number
ar: يجب أن يكون عددًا أوليًا

source: <b>Modulo</b>
ar: <b>عامل القسمة مع الباقي</b>

source: <b>Public Exponent</b>
ar: <b>الأُس العام</b>

source: <b>Private Exponent</b>
ar: <b>الأُس الخاص</b>

source: <b>Input</b>
ar: <b>المُدخَل</b>

source: Encrypt
ar: عَمِّ

source: Decrypt
ar: فُك التعمية

source: <b>Output</b>
ar: <b>المُخرَج</b>

source: Public exponent input contain invalid base64 text.
ar: مُدخَل الاُس العام ذو ترميز الأساس64 معطوب.

source: Public exponent is empty, can't operate.
ar: الأُس العام فارغ، يتعذَّر التنفيذ.

source: Private exponent input contain invalid base64 text.
ar: مُدخَل الاُس الخاص ذو ترميز الأساس64 معطوب.

source: Private exponent is empty, can't operate.
ar: الأُس الخاص فارغ، يتعذَّر التنفيذ.

source: Modulo input contain invalid base64 text.
ar: مُدخَل عامل القسمة مع الباقي ذو ترميز الأساس64 معطوب.

source: Modulo is empty, can't operate.
ar: عامل القسمة مع الباقي فارغ، يتعذَّر التنفيذ.

source: Message is longer than modulo, failed to encrypt.
ar: الرسالة أطول من عامل القسمة مع الباقي، تتعذَّر التعمية.

source: Plain text output contain invalid utf-8 bytes.
ar: المُخرجات النَصِيَّة تحوي بايتات ترميز utf-8 معطوبة.

source: Invalid padding in decrypted message, failed to decrypt.
ar: حشوة معطوبة في الرسالة المُفَك تعميتها، يتعذَّر فك التعمية.

source: Cipher text input contain invalid base64 text.
ar: مُدخَل النص المُعمى ذو ترميز الأساس64 معطوب.

source: Public exponent is not prime number, failed to generate a key.
ar: الأُس العام ليس عددًا أوليًا، يتعذَّر توليد مفتاح.
